
__author__ = 'Федоров Владислав Николаевич'

Задача #1

number = ("1", '0', "2", "3","7")
I = 0
while len(number) > I:
    print(number[I])
    I += 1

Задача #2

a = input("Введите значение переменной a:")
b = input("Введите значение переменной b:")
c=b
b=a
a=c

Задача #3

age = int(input("Сколько вам лет?:"))
if age < 21:
 print("Вам нельзя!")
else:
 print("Вам можно, здравствуйте!")